import React, { useState } from "react";
import VideoPageHero from "../components/VideoPageHero";
import DistCard from "../components/DistCard";
import SimpleDialog from "../components/SimpleDialog";
import VideoTextDialog from "../components/VideoTextDialog";

const distinations = [
  { name: "حجره العميد وسكارترية العميد", img: "./secretary.png" },
  { name: "أمين الكليه", img: "./manager2.png" },
  { name: "وكلاء الكليه", img: "./members.png" },
  {
    name: "الأقسام ومكاتب رؤساء الأقسام وأعضاء هيئة التدريس",
    img: "./members2.png",
  },
  { name: "سكرتاريه الأقسام وأعضاء التدريس ", img: "./manager1.png" },
  { name: "شئون الطلاب", img: "./student.png" },
  { name: "مدرجات", img: "./stairs.png" },
  { name: "قاعات", img: "./hall.png" },
  { name: "فصول", img: "./class.png" },
  { name: "معامل", img: "./laps.png" },
  { name: "مكتبه", img: "./library.png" },
  { name: "مصلى", img: "./pray.png" },
  { name: "الكافتيريا والاوفيس", img: "./coffe.png" },
  { name: "حمامات wc", img: "./wc.png" },
];
const distNames = [
  "حجره العميد وسكارترية العميد",
  "أمين الكليه",
  "وكلاء الكليه",
  "الأقسام ومكاتب رؤساء الأقسام وأعضاء هيئة التدريس",
  "سكرتاريه الأقسام وأعضاء التدريس ",
  "شئون الطلاب",
  "مدرجات",
  "قاعات",
  "فصول",
  "معامل",
  "مكتبه",
  "مصلى",
  "الكافتيريا والاوفيس",
  "حمامات wc",
];

const distImages = [
  "./secretary.png",
  "./manager2.png",
  "./members.png",
  "./members2.png",
  "./manager1.png",
  "./student.png",
  "./stairs.png",
  "./hall.png",
  "./class.png",
  "./laps.png",
  "./library.png",
  "./pray.png",
  "./coffe.png",
  "./wc.png",
];

const videoUrls = [
  "https://www.youtube.com/embed/rkCJy3dM3_Q?si=dGGG6_Sng6HDR4l4",
  "https://www.youtube.com/embed/by7UxGvcZb0?si=EQAcYQgPdX3cpt9x",
  "https://www.youtube.com/embed/LuBDwgKz3Rc?si=ZjnzM5it3gLX7Kgc",
  "https://www.example.com/video3.mp4",
  "https://www.youtube.com/embed/Nr8PXTjTe0U?si=zPm9bpZ_fpy_QGis",
  "https://www.youtube.com/embed/597PlJRo3c4?si=jKatKqetW4D_wX7H",
  "https://www.youtube.com/embed/y3o2EU6un7o?si=wJYCL0yvnfX94d6r",
  "https://www.youtube.com/embed/Gf6Ac3jSggI?si=MJ_scg7WAHSXGBOM",
  "https://www.example.com/video3.mp4",
  "https://www.example.com/video3.mp4",
  "https://www.example.com/video3.mp4",
  "https://www.example.com/video3.mp4",
  "https://www.example.com/video3.mp4",
];

const videoText = [
  "مكتب عميد الكلية : يقع في الدور الثاني في الممر الجنوبي على شمال السلم الجنوبي الشرقي .  سكرتارية العميد*: يقع في الممر الجنوبي على جنوب السلم الجنوبي الغربي ، بجوار مكتب عميد الكلية مباشرةً .",

  "مكتب أمين الكلية: يقع في الممر الجنوبي عليطى جنوب السلم الجنوبي الشرقي .",

  "مكتب أ.د/وكيل الكليه لشئون التعليم و الطلاب: يقع في الممر الجنوبي على شمال السلم الجنوبي الشرقي بجوار مكتب عميد الكلية . مكتب أ.د/وكيل الكليه لشئون الدراسات العليا و البحوث: يقع في الممر الجنوبي على جنوب السلم الجنوبي الغربي . مكتب أ.د/وكيل الكلية لشئون البيئه و خدمة المجتمع: يقع في الممر الجنوبي أمام مكتب عميد الكلية",

  "الأقسام ومكاتب  رؤس الأقسام وأعضاء هيئة التدريس بالاقسام  يقع قسم المساحه والمساحه البحرية ومكتب رئيس القسم ومكاتب أعضاء هيئة التدريس في الدور الثاني في الممر الشرقي للكليه *** يقع قسم اللغة العربية ومكتب رئيس القسم ومكاتب أعضاء هيئة التدريس في الدور الثالث في ممر جنوبي للكليه *** يقع قسم الجعرافيا و ومكتب رئيس القسم ومكاتب أعضاء هيئة التدريس في الدور الثالث في الممر الجنوبي للكليه *** يقع قسم اللغة الانجليزية ومكتب رئيس القسم ومكاتب أعضاء هيئة التدريس اللغة الانجليزية في الدور الثالث في ممر جنوبي للكليه *** يقع قسم اللغة الفرنسية ومكتب رئيس القسم ومكاتب أعضاء هيئة التدريس في الدور الثالث في الممر الشرقي للكليه *** يقع قسم التاريخ ومكتب رئيس القسم ومكاتب أعضاء هيئة التدريس في الدور الرابع في الممر الجنوبي للكليه *** يقع قسم الدرسات الإسلامية ومكتب رئيس القسم ومكاتب أعضاء هيئة التدريس في الدور الرابع في الممر الجنوبي للكليه ***  يقع قسم علم الاجتماع ومكتب رئيس القسم ومكاتب أعضاء هيئة التدريس في الدور الرابع في الممر الجنوبي للكليه *** يقع قسم علم النفس وبرنامج الفئات الخاصة ومكتب رئيس القسم ومكاتب أعضاء هيئة التدريس في الدور الرابع في الممر ال الجنوبي الشرقي   للكليه *** يقع قسم المكتبات ومكتب رئيس القسم ومكاتب أعضاء هيئة التدريس في الدور الرابع في الممر الجنوبي للكليه *** يقع مكتب  اللغه العربيه لغير الناطقين بها في دور الرابع في ممر الشرقي للكليه ***  يقع قسم الإعلام ومكتب رئيس القسم ومكاتب أعضاء هيئة التدريس في الدور الخامس في الممر الجنوبي للكليه ***  يقع قسم اللغات الشرقية ومكتب رئيس القسم ومكاتب أعضاء هيئة التدريس في الدور الخامس في الممر الجنوبي    للكليه ***  يقع قسم الفلسفه ومكتب رئيس القسم ومكاتب أعضاء هيئة التدريس في الدور الخامس في الممر  الجنوبي  للكليه *** يقع قسم الدراسات اليونانية ومكتب رئيس القسم ومكاتب أعضاء هيئة التدريس في الدور الخامس في الممر الجنوبي للكليه",

  "سكرتارية الأقسام: يقع بجوار السلم الجنوبي الشرقي . سكرتارية أعضاء التدريس: يقع في الممر الغربي امام السلم الجنوبي الغربي ،بجوار مكتب ا.د/وكيل الكلية لشئون التعليم و الطلاب .",

  "الشؤون اداب * تقع وحده الارشاد الاكاديمي الدور الثاني من جهة الممر المنتصف    * تقع شؤون طلاب البرامج الخاصه البرامج الخاصه الدور الثاني من جهة الممر الشمالي   * تقع شؤون الطلاب  الدور الارضي  من جهة الممر الشمالي   * تقع اداره شؤون الطلاب  الدور الارضي  من جهة الممر الشمالي * تقع شؤون العامة  الدور الارضي  من جهة الممر الشمالي",

  "مدرجات المدرجات اداب :3 مدرجات    * يقع مدرج رقم 1 الذي يسمي ب مدرج أ.د/كريم مصلح صالح في الدور الارضي من جهة الممر الشرق   * يقع مدرج رقم 2 الذي يسمي ب مدرج الترجمه الانجليزية  في الدور الثالث من جهة الممر الشرق   * يقع مدرج رقم 3 في الدور ال خامس من جهة الممر الشرقي",

  "قاعات اداب :10قاعات  *  قاعه رقم 1 الذي تسمي ب قاعه مجلس الكليه في الدور الارضي من جهة الممر الغربي   * تقع قاعه رقم 2 الذي تسمي ب قاعه المناقشات في الدور الارضي من جهة الممر الغربي * تقع قاعه رقم 3  في الدور الثاني من جهة الممر الغربي * تقع قاعه رقم 4 في الدور ثاني من جهة الممر الغربي * تقع قاعه رقم 5 الذي تسمي ب د/ناصر عبد الله في الدور ثالث من جهة الممر الغربي * تقع قاعه رقم 6 الذي تسمي ب قاعه د/فوزية جاد الله  في الدور الارضي من جهة الممر الغربي * تقع قاعه رقم 7 الذي تسمي ب أ.د/حمدي الديب  في الدور الرابع من جهة الممر الغربي * تقع قاعه رقم 8 في الدور الرابع من جهة الممر الغربي * تقع قاعه رقم 9 في الدور خامس من جهة الممر الغربي * تقع قاعه رقم 10 في الدور خامس من جهة الممر الغربي",

  "فصول اداب :20 فصل    * يقع فصل رقم 1 الذي يسمي ب برنامج المساحه والخرائط الدور الثالث من جهة الممر الشمالي   * يقع فصل رقم 2 الدور الثالث من جهة الممر المنتصف   * يقع فصل رقم 3 الذي يسمي ب برنامج اللغة الالمانية الدور الثالث من جهة الممر الشمالي   * يقع فصل رقم 4الذي يسمي ب برنامج اللغة الفرنسية  الدور الثالث من جهة الممر الشمالي * يقع فصل رقم 5 الذي يسمي ب برنامج اللغة الفرنسية الدور الثالث من جهة الممر الشمالي * يقع فصل رقم 6 الدور الثالث من جهة الممر الشمالي * يقع فصل رقم 7 الذي يسمي ب برنامج اللغة الألمانية الدور الثالث من جهة الممر الشمالي * يقع فصل رقم 8 الدور الثالث من جهة الممر الشمالي * يقع فصل رقم 9 الذي يسمي ب برنامج مجتمعات عمرانية الدور الثالث من جهة الممر الشمالي * يقع فصل رقم 10 الذي يسمي ب الفئات الخاصة  الدور الثالث من جهة الممر الشمالي   * يقع فصل رقم 11  الدور الرابع من جهة الممر المنتصف * يقع فصل رقم 12 الذي يسمي ب قاعه أ.د/منير حجاب  الدور الرابع من جهة الممر الشمالي   * يقع فصل رقم 13 الدور الرابع من جهة الممر الشمالي  * يقع فصل رقم 14 الدور الرابع من جهة الممر الشمالي   * يقع فصل رقم 15 الذي يسمي ب برنامج اللغة الإيطالية الدور الرابع من جهة الممر الشمالي   * يقع فصل رقم 16 الدور الرابع من جهة الممر الشمالي   * يقع فصل رقم 17 الدور الرابع من جهة الممر الشمالي   * يقع فصل رقم 18 الدور الرابع من جهة الممر الشمالي * يقع فصل رقم 19 الدور الرابع من جهة الممر الشمالي   * يقع فصل رقم 20 الدور الرابع من جهة الممر الشمالي",

  "1-يقع معمل الترميم في البدروم على يمين السلم الجنوبي الغربي  2-يقع معمل مساحه في البدروم في الممر الغربي على شمال السلم الجنوبي الغربي  3-يقع معمل نظم المعلومات الجغرافية في البدروم في الممر الغربي على شمال السلم الشمالي الغربي 4-يوجد ٣ معامل للغات جميعها تقع في البدروم في الممر الشمالي على يمين السلم الشمالي الغربى 5-يقع معمل الحاسب الآلي في الدور الخامس في الممر الشمالي على اليمين  6-تقع معامل القياس النفسي في البدروم في الممر الشمالي على يمين السلم الشمالي الشرقي  7-يقع معمل فئات الخاصه في البدروم في آخر الممر الشمالي بجانب معمل القياس النفسي على يمين السلم الشمالي الشرقي",

  "موقع المكتبه :-   تقع المكتبه في الدور الارضي بالتحديد في البدروم من جهة الشمال من مدخل الباب الرئيسي للكليه   محتويات المكتبه :- تحتوي المكتبه علي جميع الكتب العلميه والثقافيه ورسائل الماجستير والدكتوراه    كمان انها تنقسم الي العديد من الاقسام التي تحتوي علي الكتب التي تخص كل قسم من اقسام الكليه مثل الفلسفه وعلم النفس والاجتماع الي آخره    كيفية الدخول :- لكي يدخل الطالب الي المكتبه فعليه ان يكون معه كارنيه الجامعه او البطاقه الشخصيه ويضع حقيبته في المكان المخصص لها قبل دخوله والتي تكون بجانب الباب    كيفية استخراج كارنيه الاستعاره :- علي الطالب ان يحضر صورتين شخصيتين له و  صورتين  للبطاقه الشخصيه لاستخراج كارنيه الاستعاره   تعليمات المكتبه :- علي الطالب عدم إحضار اي مواد غذائيه ولا اطعمه الي المكتبه    ٢- عدم احداث اي ضوضاء او القراءه بصوت عالي    ٣- علي الطالب ارجاع الكتاب الي مكانه بنفس عدد رقم الترتيب الي الرف المخصص له بعد انتهاءه من القراءه .",

  "يوجد في كلية الآداب عدداً من غرف المصليات للطلبه والطالبات والتي عددها ٤ مصليات  اثنان في الدور الثالث واحده مصلى طالبات وواخر مصلى طلاب  مصلى السيدات بالقرب من مكاتب الدكاتره مصلى الطلاب بالقرب من حمام الطلاب  اما في الدور الرابع فيوجد اثنان ايضا  بنفس اماكن تواجد مصليات الدور الثالث",

  "يوجد في كلية الآداب عددا من الاوفيسات والتي يبلغ عددها ٦ وواحد في كافتيريا كبيره في ميدان كلية الآداب    ١- الدور الارضي:- تقع الكافتيريا في الدور الارضي في ميدان الكليه من ناحية الغرب علي جهة الشمال من المدخل الرئيسي لكلية الآداب والتي تحتوي علي المواد الغذائية والمشروبات الساخنه و البارده    ٢- الدور الثاني علوي تحتوي على ٣ من الاوفيس واحد بجانب حمام الطلاب وواحد بجانب حمام الطالبات والثالث بالقرب من  قاعة  قسم ترجمة الالماني وهناك اوفيس خاص بعميد الكليه يقع بجانب مكتب امين الكليه    ٣- الدور الثالث :- يوجد به أوفيس واحد يقع بجانب حمام اعضاء هيئة التدريس في الطرقه اقرب لناحية اليمين بالقرب من سلم الدور    ٤-الدور الرابع :- يوجد به ٢ اوفيس واحد يقع بين مكتب اعضاء تدريس قسم المكتبات وحمام الطلاب واخر يقع بجانب حمام الطلاب من الناحيه الاخرى في الجهة المقابله",

  "الدور الارضي    حمام طلاب بجانب غرفة اتحاد الطلبه *  حمام طالباتبد بجانب مدير المكتبه *   حمام مجلس الكليه بجانب مكتب منسق عام البرامج الجديده *    حمام طلاب بجانب شئون طلبه *   حمام طالبات بجانب  مخازن شئون الطلبه*   الدور الثاني يوجد به 8 حمامات عبارة عن *   حمام طلاب بجانب مصلي الرجال *   حمام أعضاء هيئة التدريس بجانب سكرتاريه أ.د وكيل الشؤون الكليه*   حمام أعضاء هيئة التدريس بجانب وحده المقررات الالكترونيه *   حمام طالبات بجانب قاعه المساحة البحرية *   حمام طالبات بجانب قاعه ترجمه الماني *   حمام طلاب بجانب الأوفيس *   حمام طالبات بجانب الأوفيس *   حمام أعضاء هيئة التدريس بجانب سكرتاريه أ.د وكيل الكليه لشؤون التعليم والطلاب *   الدور الثالث يوجد به 8 حمامات عبارة عن*   حمام أعضاء هيئة التدريس بجانب فصل واحد برنامج المساحة *   حمام طلاب بجانب مصلي الطالبات *   حمام أعضاء هيئة التدريس بجانب أعضاء هيئة تدريس قسم اللغه الانجليزيه *   حمام طالبات بجانب فصل تلاته برنامج اللغة الألمانية *   حمام أعضاء هيئة التدريس بجانب مكتب معديين قسم اللغه الانجليزيه *   حمام أعضاء هيئة التدريس بجانب الأوفيس*   حمام طالبات*   حمام أعضاء هيئة التدريس بجانب أ.د *   الدور الرابع 8 حمامات عبارة عن*   حمام طلاب بجانب فصل 13*   حمام طلاب بجانب أ.د فتوح خليل *   حمام طلاب بجانب الأوفيس *   حمام طلاب بجانب الأوفيس *   حمام طالبات فصل 12*   حمام طالبات بجانب مكتب اللغه العربيه لغير الناطقين بها *   الدور الخامس يوجد به 8 حمامات عبارة عن*   حمام طلاب بجانب الأوفيس*   حمام طالبات بجانب أعضاء هيئة التدريس *   حمام أعضاء هيئة التدريس بجانب الأوفيس *   حمام بجانب غرفة الاكنترول *   حمام بجانب كنترول برنامج 2و4* حمام طالبات بجانب أعضاء تدريس اعلام * حمام أعضاء هيئة التدريس سيدات بجانب أعضاء تدريس اعلام *   حمام أعضاء هيئة تدريس رجالي بجانب أعضاء هيئة تدريس قسم الفلسفه",
];

function ArtsCollegePage() {
  const [isDialogOpen, setIsDialogOpen] = useState(false);
  const [isTextDialogOpen, setIsTextDialogOpen] = useState(false);
  const [selectedVideoIndex, setSelectedVideoIndex] = useState(null);
  const [selectedVideoTitle, setSelectedVideoTitle] = useState("");

  const handleCardClick = (index, title) => {
    setSelectedVideoIndex(index);
    setSelectedVideoTitle(title);
    setIsDialogOpen(true);
  };

  const handleEditBtnClick = (index, title) => {
    setSelectedVideoIndex(index);
    setSelectedVideoTitle(title);
    setIsTextDialogOpen(true);
  };

  const handleCloseDialog = () => {
    setIsDialogOpen(false);
    setSelectedVideoIndex(null);
    setSelectedVideoTitle("");
  };

  const handleTextDialogClose = () => {
    setIsTextDialogOpen(false);
    setSelectedVideoIndex(null);
    setSelectedVideoTitle("");
  };

  return (
    <>
      <div>
        <VideoPageHero place={"كلية الآداب"} />
      </div>

      <div
        className="container mx-auto border min-h-96 p-4 flex items-center justify-center bg-no-repeat bg-bottom"
        style={{
          backgroundImage: "url('play-button.png')",
          backgroundSize: "200px",
          backgroundPosition: "bottom left",
        }}
      >
        <div className="my-3 grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 lg:grid-cols-4 gap-4 grid-flow-row">
          {/* {distNames.map((title, index) => (
            <DistCard
              key={index}
              title={title}
              imageSrc={distImages[index]}
              onPlayButtonClick={() => handleCardClick(index)}
              onEditButtonClick={() => handleEditBtnClick(index)}
            />
          ))} */}

          {distinations.map((dist, index) => (
            <DistCard
              key={index}
              title={dist.name}
              imageSrc={dist.img}
              onPlayButtonClick={() => handleCardClick(index)}
              onEditButtonClick={() => handleEditBtnClick(index)}
            />
          ))}
        </div>
      </div>

      <div>
        <SimpleDialog
          isOpen={isDialogOpen}
          onClose={handleCloseDialog}
          videoSrc={
            selectedVideoIndex !== null ? videoUrls[selectedVideoIndex] : ""
          }
          title={
            selectedVideoIndex !== null ? distNames[selectedVideoIndex] : ""
          }
        />

        <VideoTextDialog
          isTextDialogOpen={isTextDialogOpen}
          onClose={handleTextDialogClose}
          textSrc={
            selectedVideoIndex !== null ? videoText[selectedVideoIndex] : ""
          }
          textTitle={
            selectedVideoIndex !== null ? distNames[selectedVideoIndex] : ""
          }
        />
      </div>
    </>
  );
}

export default ArtsCollegePage;
